Repository: musmanmalik/xblock-chat
Catalog: chat/translations/*/LC_MESSAGES/text.po
Languages: eo, es_419, ko_kr

source: Title (display name)
eo: Tïtlé (dïspläý nämé) Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, #
es_419: Título (nombre a mostrar)
ko_kr: 제목(표시 이름)

source: Title to display
eo: Tïtlé tö dïspläý Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αм#
es_419: Título a mostrar
ko_kr: 표시할 제목

source: Chat XBlock
eo: Çhät XBlöçk Ⱡ'σяєм ιρѕυм ∂σłσя #
ko_kr: 채팅 XBlock

source: Chat subject
eo: Çhät süßjéçt Ⱡ'σяєм ιρѕυм ∂σłσя ѕ#
es_419: Chat sujeto
ko_kr: 채팅 주제

source: Subject being discussed in the chat
eo: Süßjéçt ßéïng dïsçüsséd ïn thé çhät Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєт#
es_419: Sujeto de discusión en el chat
ko_kr: 채팅에서 토론 중인 주제

source: Steps
eo: Stéps Ⱡ'σяєм ιρѕ#
es_419: Pasos
ko_kr: 단계

source: Sequence of steps (in YAML). Each step is a mapping where the key represents the step id and whose value is a nested mapping with the following keys: 'messages' (sequence of strings), 'image-url' (optional string), 'image-alt' (optional string), 'responses' (optional sequence of response mappings). In the response mappings the key represents the message displayed to the user as a response button and the value is the id of the next step.
eo: Séqüénçé öf stéps (ïn ÝÀML). Éäçh stép ïs ä mäppïng whéré thé kéý réprésénts thé stép ïd änd whösé välüé ïs ä néstéd mäppïng wïth thé föllöwïng kéýs: 'méssägés' (séqüénçé öf strïngs), 'ïmägé-ürl' (öptïönäl strïng), 'ïmägé-ält' (öptïönäl strïng), 'réspönsés' (öptïönäl séqüénçé öf réspönsé mäppïngs). Ìn thé réspönsé mäppïngs thé kéý réprésénts thé méssägé dïspläýéd tö thé üsér äs ä réspönsé ßüttön änd thé välüé ïs thé ïd öf thé néxt stép.#
es_419: Secuencia de pasos (en YAML). Cada paso es un mapeo donde la llave representa el id del paso y el valor es un mapeo anidado con las siguientes llaves: 'messages' (secuencia de strings), 'image-url' (opcional), 'image-alt' (opcional), 'responses' (opcional secuencia de mapeo de respuestas). En el mapeo de respuestas la llave representa el mensaje a mostrar al usuario como botón y el valor es el id del siguiente paso
ko_kr: 단계의 시퀀스(YAML 형식)입니다. 각 단계는 매핑으로, 여기에서 키는 단계 id를 나타내며 매핑의 값은 중첩 매핑으로서 'messages'(문자열 시퀀스), 'image-url'(선택적 문자열), 'image-alt'(선택적 문자열), 'responses'(선택적 응답 매핑 시퀀스) 키를 갖습니다. 응답 매핑에서 키는 사용자에게 응답 버튼으로 표시되는 메시지를 나타내며 값은 다음 단계의 id입니다.

source: Bot profile image URL
eo: Böt pröfïlé ïmägé ÛRL Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, #
es_419: URL de imagen de perfil para el Bot
ko_kr: 봇 프로필 이미지 URL

source: For example, http://example.com/bot.png or /static/bot.png. In Studio, you can upload images from the Content - Files & Uploads page.If using multiple bot personas, can be a YAML mapping of bot_id: image_url pairs.
eo: För éxämplé, http://éxämplé.çöm/ßöt.png ör /stätïç/ßöt.png. Ìn Stüdïö, ýöü çän üplöäd ïmägés fröm thé Çöntént - Fïlés & Ûplöäds pägé.Ìf üsïng mültïplé ßöt pérsönäs, çän ßé ä ÝÀML mäppïng öf ßöt_ïd: ïmägé_ürl päïrs. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α∂ιριѕι¢ιηg єłιт, ѕє∂ ∂σ єιυѕмσ∂ тємρσя ιη¢ι∂ι∂υηт υт łαвσяє єт ∂σłσяє мαgηα αłιqυα. υт єηιм α∂ мιηιм νєηιαм, qυιѕ ησѕтяυ∂ єχєя¢ιтαтιση υłłαм¢σ łαвσяιѕ ηιѕι υт αłιqυιρ єχ єα ¢σммσ∂σ ¢σηѕєqυαт. ∂υιѕ αυтє ιяυяє ∂σłσя ιη яєρяєнєη∂єяιт ιη νσłυρтαтє νєłιт єѕѕє ¢ιłłυм ∂σłσяє єυ ƒυgιαт ηυłłα ραяιαтυя. є#
es_419: Por ejemplo, http://example.com/bot.png o /static/bot.png. En Studio, puedes subit imagenes en el menú Content - Files & Uploads. Si se usan múltiples bot personas, se puede usar un mapeo en formato YAML con pares de bot_id: image_url
ko_kr: 예를 들어 http://example.com/bot.png 또는 /static/bot.png입니다. Studio에서는 콘텐츠 - 파일 및 업로드 페이지에서 이미지를 업로드할 수 있습니다. 여러 봇 페르소나를 사용 중인 경우 bot_id: image_url 쌍의 YAML 매핑일 수 있습니다.

source: Avatar border color
eo: Àvätär ßördér çölör Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт,#
es_419: Color de borde del Avatar
ko_kr: 아바타 테두리 색상

source: Standard colors are #fdfe02 (yellow), #0000fe (blue), #ff551e (dark orange), #00ffff (cyan), #cccccc (grey), #fe0090 (fuchsia), #adff00 (lime), #fd9705 (light orange), #bf00fe (magenta), #39b54a (green)
eo: Ständärd çölörs äré #fdfé02 (ýéllöw), #0000fé (ßlüé), #ff551é (därk örängé), #00ffff (çýän), #çççççç (gréý), #fé0090 (füçhsïä), #ädff00 (lïmé), #fd9705 (lïght örängé), #ßf00fé (mägéntä), #39ß54ä (gréén) Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α∂ιριѕι¢ιηg єłιт, ѕє∂ ∂σ єιυѕмσ∂ тємρσя ιη¢ι∂ι∂υηт υт łαвσяє єт ∂σłσяє мαgηα αłιqυα. υт єηιм α∂ мιηιм νєηιαм, qυιѕ ησѕтяυ∂ єχєя¢ιтαтιση υłłαм¢σ łαвσяιѕ ηιѕι υт αłιqυιρ єχ єα ¢σммσ∂σ ¢σηѕєqυαт. ∂υιѕ αυтє ιяυяє ∂σłσя ιη яєρяєнєη∂єяιт ιη νσłυρтαтє νєłιт єѕѕє ¢ιłłυм ∂σłσяє єυ ƒυgιαт ηυłłα ραяιαтυя. єχ¢єρтєυя ѕιηт σ¢¢αє#
es_419: Colores estándar son #fdfe02 (amarillo), #0000fe (azul), #ff551e (naranja oscuro), #00ffff (cian), #cccccc (gris), #fe0090 (fuchsia), #adff00 (lima), #fd9705 (naranja claro), #bf00fe (magenta), #39b54a (verde)
ko_kr: 표준색은 #fdfe02(노란색), #0000fe(파란색), #ff551e(짙은 주황색), #00ffff (청록색), #cccccc(회색), #fe0090(자홍색), #adff00(연두색), #fd9705(옅은 주황색), #bf00fe(자주색), #39b54a(녹색)입니다.

source: Enable restart button
eo: Énäßlé réstärt ßüttön Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, #
es_419: Habilitar botón de reinicio
ko_kr: 재시작 버튼 활성화

source: List of dictionaries representing the messages exchanged between the bot and the user. Each dictionary has the form: {'from': ..., 'message': '...', 'step': id}. The possible values for 'from' are default_data.USER_ID, default_data.DEFAULT_BOT_ID, or a custom bot ID.
eo: Lïst öf dïçtïönärïés répréséntïng thé méssägés éxçhängéd ßétwéén thé ßöt änd thé üsér. Éäçh dïçtïönärý häs thé förm: {'from': ..., 'message': '...', 'step': id}. Thé pössïßlé välüés för 'fröm' äré défäült_dätä.ÛSÉR_ÌD, défäült_dätä.DÉFÀÛLT_BÖT_ÌD, ör ä çüstöm ßöt ÌD. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α∂ιριѕι¢ιηg єłιт, ѕє∂ ∂σ єιυѕмσ∂ тємρσя ιη¢ι∂ι∂υηт υт łαвσяє єт ∂σłσяє мαgηα αłιqυα. υт єηιм α∂ мιηιм νєηιαм, qυιѕ ησѕтяυ∂ єχєя¢ιтαтιση υłłαм¢σ łαвσяιѕ ηιѕι υт αłιqυιρ єχ єα ¢σммσ∂σ ¢σηѕєqυαт. ∂υιѕ αυтє ιяυяє ∂σłσя ιη яєρяєнєη∂єяιт ιη νσłυρтαтє νєłιт єѕѕє ¢ιłłυм ∂σłσяє єυ ƒυ#
es_419: Lista de diccionarios representando los mensajes intercambiados entre el bot y el usuario. Cada diccionario tiene como formato: {'from': ..., 'message': '...', 'step': id}. Los valores posibles para 'form' son default_data.USER_ID, default_data.DEFAULT_BOT_ID, o un bot ID personalizado.
ko_kr: 봇과 사용자 사이에 주고 받은 메시지를 나타내는 사전의 목록입니다. 각 사전은 {'from': ..., 'message': '...', 'step': id} 형식으로 되어 있습니다. ‘from’에 들어갈 수 있는 값은 default_data.USER_ID, default_data.DEFAULT_BOT_ID 또는 맞춤형 봇 ID입니다.
